{
	"latest": 44,
	"version": "1.12 Release",
	"updateurl":"https://raw.githubusercontent.com/TheMrThor/AScript/main/13_GG.luac",
	"critical": false,
	"changes": [
		"Добавлено меню контроля крышевания мафиями бизнесов. Открыть его можно командой /mafia",
		"Добавлена функция «Направление взгляда», она позволяет видеть в какую сторону направлена камера игрока. Включить можно в /amenu - Админ ПО - Чит программы",
		"Добавлена функция спавна в той организации, которую выбрали через /amembers. Включить можно в /amenu - Основное - Полезные функции",
		"Улучшена команда /removeitem. Для неё добавлен 3-ий необязательный аргумент, в котором Вы можете указать максимальный ид предмета для удаления",
		"Полностью изменена функция проверки игроков на определённом уровне (/abot). Теперь оно выглядит более эстетично и с ним у Вас не возникнет никаких проблем",
		"Добавлена функция «Шаблон ответа». Это текст, который будет по умолчанию вставлен в поле ответа, дабы вам не приходилось писать его вручную (например приветствие или пожелание приятной игры)",
		"Добавлена функция «Пропуск окна с Акциями». Окно с информацией о празднике или акциях при входе в игру не будет отображаться. Включить можно в /amenu - Основное - Полезные функции",
		"Добавлен счётчик сообщений в правом нижнем углу окна рабочего чата (/aj)",
		"Теперь при телепорте игрока на ближайшую дорогу, вместе с ним будет телепортироваться ближайшее к нему свободное авто в радиусе 10 метров",
		"В список админ-форм добавлены команды /setbizmafia, /notif, /delbname и /delhname",
		"В оффлайн выдачу наказаний добавлена поддержка команд /notif, /delbname и /delhname",
		"Теперь при выполнении админского квеста он будет автоматически завершаться",
		"Добавлена функция «Слап стрелками в /re». Так же если зажать CTRL то слапнется машина игрока, за которым вы следите. Включить можно в /amenu - Основное - Полезные функции",
		"В окно проверки NonRP ников добавлена дополнительная кнопка взаимодействия «/pm», которая напишет игроку, что ему необходимо сменить свой ник",
		"Так же в окно проверки NonRP ников добавлена функция отображения цвета ника, чтобы понять, имеет ли игрок организацию",
		"Добавлена возможность переходить в слежку за сотрудником выбрав его в /members",
		"Команде «/freeze» Добавлен дополнительный необязательный параметр - секунды. Теперь можно указать на сколько секунд заморозить игрока и скрипт через это время автоматически разморозит его",
		"Теперь подключатся к серверу можно в свёрнутом режиме, а скрипт оповестит Вас о том, что вы подключились",
		"Полностью изменена функция трассировки выстрелов. Теперь в ней много настроек и она корректно работает",
		"Добавлена возможность переключать дальний чат по кнопке",
		"Полностью переделан чекер организаций. Теперь он гораздо функциональнее",
		"Добавлена функция «Контроль репорта». Когда репорт поднимется выше определённого значения, будь то Вы в игре или свернуты, Вам придёт уведомление",
		"Добавлена команда /is13, с помощью которой можно узанть, играет тот или иной администратор с 13=GG Tools (даже с другого сервера)",
		"Добавлен снегопад в главное меню скрипта, зима же на дворе :)",
		"Вырезана функция «Фильтр чата»",
		"Изменена функция «Анти-Слежка», Теперь она работает только на администраторов, чей уровень ниже вашего",
		"Проведена работа над окном информации о игроке в слежке, а так же исправлено неверное отображение информации (например фракции или ранга)",
		"Через /sskin теперь можно выдавать себе даже кастомные скины",
		"Теперь когда Вы указываете GPS при ответе на репорт, написанный ранее текст не будет стираться",
		"Исправлена проблема, когда не ставился курсор в строку ответа на первый за сессию репорт",
		"Теперь если написать «q» (распальцовка), «)» (улыбнуться) или другую иную чат-эмоцию при включенной функции «Авто /b» то она отправится в обычный чат, а не в /b",
		"Во время использования очереди слежки теперь можно переключатся между игроками с помощью стрелок на клавиатуре (если включена эта функция)",
		"Полностью переработаны серверные диалоги снятия и постановления на лидерку. Теперь в них гораздо легче сориентироваться",
		"Теперь 5+ в админ чекере будут отображается только в том случае если авторизовались на сервере (Анти рак-бот)",
		"Изменена логика обновления режима слежки всвязи добавлением специальной новой команды. Это должно помочь избавится от некоторых багов",
		"Исправлен баг, когда пометка говорящая о том, что администратор без аццепта не отображалась в админ-чекере",
		"Исправлена проблема когда в чекере зоны стрима при включенном отображении всех игроков, отображался только один игрок",
		"Исправлен баг, когда при выходе с АФК флудило ответами на вопросы в репорт",
		"Исправлена проблема, когда клавиша взятия репорта иногда переставала работать",
		"Исправлены все баги при использовании функции «Контроль АФК»",
		"Исправлена проблема с долгим чёрным экраном при разворачивании игры",
		"#45: Фикс краша при развороте игры"
	],
	"servers": [
		{ "address": "185.169.134.3:7777", "id": 1 },
		{ "address": "185.169.134.4:7777", "id": 2 },
		{ "address": "185.169.134.43:7777", "id": 3 },
		{ "address": "185.169.134.44:7777", "id": 4 },
		{ "address": "185.169.134.45:7777", "id": 5 },
		{ "address": "185.169.134.5:7777", "id": 6 },
		{ "address": "185.169.134.59:7777", "id": 7 },
		{ "address": "185.169.134.61:7777", "id": 8 },
		{ "address": "185.169.134.107:7777", "id": 9 },
		{ "address": "185.169.134.109:7777", "id": 10 },
		{ "address": "185.169.134.166:7777", "id": 11 },
		{ "address": "185.169.134.171:7777", "id": 12 },
		{ "address": "185.169.134.172:7777", "id": 13 },
		{ "address": "185.169.134.173:7777", "id": 14 },
		{ "address": "185.169.134.174:7777", "id": 15 },
		{ "address": "80.66.82.191:7777", "id": 16 },
		{ "address": "80.66.82.190:7777", "id": 17 },
		{ "address": "80.66.82.188:7777", "id": 18 },
		{ "address": "80.66.82.168:7777", "id": 19 },
		{ "address": "80.66.82.159:7777", "id": 20 },
		{ "address": "80.66.82.200:7777", "id": 21 },
		{ "address": "80.66.82.144:7777", "id": 22 },
		{ "address": "80.66.82.132:7777", "id": 23 },
		{ "address": "80.66.82.162:5125", "id": 101 },
		{ "address": "80.66.82.148:5125", "id": 102 },
		{ "address": "80.66.82.136:5125", "id": 103 },
		{ "address": "80.66.82.147:7777", "id": 1000 }
	],
	"files": {
		"gps": 5,
		"gps_vc": 3,
		"questions": 2,
		"server_cmd": 1,
		"admin_cmd": 2,
		"vehicles": 4
	},
	"api_url": "https://api.13-GG.com/"
}
