{
	"latest": 40,
	"version": "1.11 Release",
	"updateurl":"https://raw.githubusercontent.com/TheMrThor/AScript/main/13_GG.luac",
	"critical": false,
	"changes": [
		"Добавлен раздел игровых чатов (/amenu), а вместе с ним и функция полного контроля над рабочим чатом (/j)",
		"Добавлена возможность взаимодействовать с игроком/машиной просто кликнув по нему правой кнопкой мыши",
		"Теперь после отправки обращения к разработчикам через /reptools вы можете получить ответ на свой вопрос прямо в игре",
		"Добавлена возможность отображения информации из статистики за ВСЁ время (репорт, онлайн, афк, репутация и т.д.)",
		"В информационную панель слежки добавлена кнопка просмотра всех загруженных авто игрока с возможностью взаимодействовать с ними",
		"Добавлена функция очереди слежки, а так же изменена логика работы команды /re. Теперь вы можете ввести «/re 123 444 Conor 234» и у Вас откроется очередь слежки за всеми, кого Вы указали",
		"Добавлена функция изменения угла обзора камеры (FOV). Найти можно в /amenu - Админ ПО - Чит программы",
		"Обновлён внешний вид раздела «Админ ПО». Теперь он интуитивно более понятен и у новичков не возникнет вопросов по типу «ДА ГДЕ ЖЕ ЭТОТ ЧЁРТОВ ВХ НА ТАЧКИ??!»",
		"Добавлена новая функция - «Radar Hack». Она позволяет видеть ID игроков и транспорта на радаре возле их меток (/amenu - Админ ПО - Radar Hack)",
		"Обновлено окно проверки мульти-аккаунтов, теперь оно может работать в фоне, а так же теперь можно переходить в очередь слежки за всеми аккаунтами на найденом IP",
		"Теперь подтверждать E-mail игроков будет чуть проще. При открытии окна с подтверждением почты, скрипт автоматически проверит IP игрока",
		"В меню личного транспорта (/cars - Ваш транспорт) добавлен пункт «Телепортировать к себе»",
		"Добавлена возможность изменить цвет сообщений репортов и ответов на них в чате (/amenu - Основное - Полезные функции)",
		"Добавлена функция «Копировать ник при выходе». Если при слежке за игроком он выйдет из игры, скрипт автоматически скопирует его ник в буффер обмена (/amenu - Основное - Полезные функции)",
		"Для GodMode (Режима бессмертия) добавлены настройки выбора, где использовать данный чит: на игроке, на транспорте или на всём сразу",
		"Добавлена горячая клавиша для ответа автору последнего репорта, что указанный им игрок ничего не нарушает (/amenu - Основное - Горячие клавиши)",
		"В список админ-форм добавлены команды /setname, /removeitem, /pgetip и /cure",
		"Добавлена функция «Анти-слежка». При попытке начать следить за вами - администратора будет спавнить",
		"Добавлен пункт AFK в боковую упрощённую панель информации в слежке",
		"Исправлена проблема, когда невозможно было выключить функцию принятия админ-форм",
		"Теперь комментарии в биндере создаются через :: (два двоеточия), ранее было //",
		"Добавлена возможность указать зажержку в /rslap и /rpm",
		"Исправлен автологин в /apanel, теперь снова работает при входе на сервер",
		"Функция «Спавн по координатам» теперь работает как серверная и меняет вашу точку спавна аналогично тому, как это реализовано для игроков имеющих Premium VIP",
		"Надпись «Report++» при репорте 10+ теперь снова скрывается",
		"Исправлен краш с переходом в слежку за автором последнего репорта через бинд",
		"Улучшено поведение и отзывчивость джетпака на высокой скорости",
		"Исправлен краш после появления строчки о подозрении администратора во взломе",
		"Теперь кликварп можно отключить клавишей ESC",
		"Исправлены некоторые баги при слежке за администратором",
		"Переписана система сохранения статистики. Проблема с крашем после внезапного отключения света должна уйти",
		"Информационные панели (эксклюзивные 1 и 2) временно вырезаны и отправлены на переработку, они вернуться в ближайших обновлениях",
		"Увеличена минимальная задержка при отправке информации об IP в админ-чат",
		"Функция «Анти-слап с машины» теперь работает на железнодорожном транспорте",
		"Команда /trp теперь может принимать ID игрока, находящегося рядом с вами"
	],
	"servers": [
		{ "address": "185.169.134.3:7777", "id": 1 },
		{ "address": "185.169.134.4:7777", "id": 2 },
		{ "address": "185.169.134.43:7777", "id": 3 },
		{ "address": "185.169.134.44:7777", "id": 4 },
		{ "address": "185.169.134.45:7777", "id": 5 },
		{ "address": "185.169.134.5:7777", "id": 6 },
		{ "address": "185.169.134.59:7777", "id": 7 },
		{ "address": "185.169.134.61:7777", "id": 8 },
		{ "address": "185.169.134.107:7777", "id": 9 },
		{ "address": "185.169.134.109:7777", "id": 10 },
		{ "address": "185.169.134.166:7777", "id": 11 },
		{ "address": "185.169.134.171:7777", "id": 12 },
		{ "address": "185.169.134.172:7777", "id": 13 },
		{ "address": "185.169.134.173:7777", "id": 14 },
		{ "address": "185.169.134.174:7777", "id": 15 },
		{ "address": "80.66.82.191:7777", "id": 16 },
		{ "address": "80.66.82.190:7777", "id": 17 },
		{ "address": "80.66.82.188:7777", "id": 18 },
		{ "address": "80.66.82.168:7777", "id": 19 },
		{ "address": "80.66.82.159:7777", "id": 20 },
		{ "address": "80.66.82.200:7777", "id": 21 },
		{ "address": "80.66.82.144:7777", "id": 22 },
		{ "address": "80.66.82.132:7777", "id": 23 },
		{ "address": "80.66.82.162:5125", "id": 101 },
		{ "address": "80.66.82.148:5125", "id": 102 },
		{ "address": "80.66.82.136:5125", "id": 103 },
		{ "address": "80.66.82.147:7777", "id": 1000 }
	],
	"files": {
		"gps": 5,
		"gps_vc": 3,
		"questions": 2,
		"server_cmd": 1,
		"admin_cmd": 2,
		"vehicles": 4
	},
	"api_url": "https://api.13-GG.com/"
}
