{
	"latest": 29,
	"version": "1.6 Release",
	"updateurl":"https://raw.githubusercontent.com/TheMrThor/AScript/main/13_GG.luac",
	"critical": false,
	"changes": [
		"Изменён сервис получения карты в /getip (Теперь работает в Украине)",
		"Улучшен биндер: добавлена возможность создать бинд на команду с возможностью указанием параметров, а так же добавлены новые теги",
		"Добавлена кнопка для отображения/скрытия карты в /getip (по умолчанию выключена)",
		"Добавлен интерфейс для команды /reptools, а так же значительно расширен её функционал. ",
		"Переработаны команды /rpm и /rslap, а так же добавлена команда /rkick. Теперь всё осуществеляется через диалоговое окно, в котором можно выбрать тех игроков, на которых не нужно применять действие",
		"Продолжаем улучшать дизайн, а вместе с ним и опыт использования скрипта! В этот раз добавлены анимации к кнопкам переключения вкладов в главном меню, увеличились закругления на всех окнах, а так же улучшен внешний вид подсказок",
		"Добавлена возможность переходить в рекон за указанным игроком в репорте, просто кликнув по ID в тексте репорта",
		"Изменен метод сохранения некоторых функций. При первом запуске возможен откат некоторых настроек (ВХ, админ-чекер, килл-лист) на исходное состояние",
		"Клик-варп теперь игнорирует вашего персонажа и не даёт телепортироватся на самого себя",
		"При телепорте на вертикальные обьекты, используя клик-варп, вы будете телепортироватся не на самый край, а в метре от него",
		"В кнопках ответов на репорт убран тег [A], если ответ автоматический",
		"Увеличен макисмальный интервал между выдачей наказаний в окне «Оффлайн выдача наказзаний»",
		"Теперь в реконе видно ник владельца посаженного дерева на ферме",
		"При слежке за администратором вы будете переходить за теми же игроками в рекон, что и он",
		"Добавлена возможность отключения функции «XRAY» в кликварпе",
		"Добавлена возможность копировать координаты нажатием клавиши «F» при включенном клик-варпе",
		"Добавлена возможность скрыть активный курсор по нажатию на Esc",
		"Добавлена возможность указать минимальное афк в /admins afk. Так например, при вводе «/admins afk 300» скрипт покажет всех админов, у которых афк больше или равно 300 секундам",
		"Добавлена возможность переходить в рекон за админом, если нажать на него в админ-чекере",
		"Исправлен баг, когда отдаление камеры в реконе срабатывало когда активен курсор",
		"Исправлен баг, когда при открытии чата (F6) с открытым окном ответа на репорт курсор не фокусировался в строке ввода",
		"Исправлен баг, когда не работали кнопки /az и /re в чекере NonRP ников",
		"Исправлен баг, когда писало что не указаны ID в репорте, хотя они были",
		"Исправлен баг, когда функция смены раскладки текста в репорте неправильно переводила текст",
		"Исправлен баг, когда часовой пояс считался наоборот (Например, стояло +4, а считало как -4)",
		"Исправлен баг, когда не авторизовывало в /apanel при входе на сервер",
		"Исправлен баг, когда в кастомном WH писало количество брони в полоске здоровья",
		"Исправлен баг, когда некорректно сохранялась статистика при резком закрытии GTA (Например, когда выключили свет)",
		"#29: Навели порядок после обновления и исправили пару проблем"
	],
	"servers": [
		{ "address": "185.169.134.3:7777", "id": 1 },
		{ "address": "185.169.134.4:7777", "id": 2 },
		{ "address": "185.169.134.43:7777", "id": 3 },
		{ "address": "185.169.134.44:7777", "id": 4 },
		{ "address": "185.169.134.45:7777", "id": 5 },
		{ "address": "185.169.134.5:7777", "id": 6 },
		{ "address": "185.169.134.59:7777", "id": 7 },
		{ "address": "185.169.134.61:7777", "id": 8 },
		{ "address": "185.169.134.107:7777", "id": 9 },
		{ "address": "185.169.134.109:7777", "id": 10 },
		{ "address": "185.169.134.166:7777", "id": 11 },
		{ "address": "185.169.134.171:7777", "id": 12 },
		{ "address": "185.169.134.172:7777", "id": 13 },
		{ "address": "185.169.134.173:7777", "id": 14 },
		{ "address": "185.169.134.174:7777", "id": 15 },
		{ "address": "80.66.82.191:7777", "id": 16 },
		{ "address": "80.66.82.190:7777", "id": 17 },
		{ "address": "80.66.82.188:7777", "id": 18 },
		{ "address": "80.66.82.168:7777", "id": 19 },
		{ "address": "80.66.82.159:7777", "id": 20 },
		{ "address": "80.66.82.200:7777", "id": 21 },
		{ "address": "80.66.82.144:7777", "id": 22 },
		{ "address": "80.66.82.132:7777", "id": 23 },
		{ "address": "80.66.82.162:5125", "id": 101 },
		{ "address": "80.66.82.148:5125", "id": 102 },
		{ "address": "80.66.82.136:5125", "id": 103 },
		{ "address": "80.66.82.147:7777", "id": 1000 }
	],
	"files": {
		"gps": 2,
		"gps_vc": 2,
		"questions": 2,
		"server_cmd": 1,
		"admin_cmd": 2,
		"vehicles": 4
	},
	"api_url": "https://13-GG.com/"
}
