{
	"latest": 8,
	"version": "1.0 Release",
	"updateurl":"https://raw.githubusercontent.com/TheMrThor/AScript/main/13_GG.luac",
	"critical": false,
	"changes": [
		"На замену старому и мало функциональному админ чекеру пришёл новый!",
		"Обновлён GPS! Теперь там не только актуальная информация, но и появилась дополнительная кнопка - указать место ироку на карте!",
		"Помимо GPS обновлены команды (в том числе и админские), названия машин и GPS в городе Vice City",
		"Создание /ao оповещений переехало во вкладку «Биндеры» на вторую страницу",
		"Команда /rpm научилась договаривать, то, что ей положено, а не останавливаться на первом слове",
		"Убран показатель максимальной скорости в панели рекона, он частенько Вам врал!",
		"Добавлена новая функция - «BunnyHop». Почему бы не по нон-рпшить на админке?",
		"Для ГА и его заместителя были добавлены команды /addrep и /addrepall. Теперь добавить репутацию к имеющейся можно не прибегая к «сложным математическим вычислениям»",
		"В окне репорта появился значок, информирующий о том, с чего играет игрок. Говорят, иногда это помогает при ответе",
		"Появилась возможность переназначить переключение Kill-Листа с F9 на любую другую клавишу",
		"Добавлена команда /descs. Она включает логирование в чат описаний игроков, которые находятся рядом с Вами. Так гораздо проще находить и наказывать «целеустремлённых» игроков",
		"Добавлена вывод ошибок в админ-чат при принятии форм. На ошибках учатся, а вы будете помогать в этом!",
		"Появилась функция «Авто /amember». После авторизации в /apanel вы автоматически вступите в нужную вам организацию",
		"Команда /tp, введённая без аргументов, будет открывать ТП-Меню",
		"В окошке NonRP ников появились две новые кнопки: /re и /az, а так же список игроков теперь сортируется по уровню - от меньшего к большему",
		"Вырезана адаптация к Village RP (Неактуально)",
		"Рефакторизирована система сохранения настроек",
		"Добавлены варнинги на различные типы рванок",
		"Добавлена команда /ferma, с её помощью можно в разы быстрее пополнить склады фермы и завода",
		"Пришлось убрать возможность включать ловлю репорта находясь в реконе, так как это вызывало некоторые проблемы",
		"В связи с тем, что появился новый админ-чекер, был обновлён чекер для обычных игроков. Он стал намного приятнее выглядеть и появилось больше настроек!",
		"Был произведён полный переход в системе загрузки и проверки обновлений на библиотеку «requests». Это поможет полностью избежать проблему загрузки обновлений у некоторых пользователей",
		"Усовершенствованна логика телепорта по метке",
		"Исправлена двойная выдача команды /warnoff в системе оффлайн наказаний",
		"Теперь виджет админ-формы корректно отображает пропущенную форму, если её принял пользователь стороннего админ-тулса",
		"Возвращена функция предварительной слежки за игроком, на которого пришла форма",
		"Исправлена проблема, когда скрипт не учитывал подтверждение аццепта через код",
		"Улучшена логика переноса текста репорта, при передаче в админ-чат",
		"Скорректирована автоматическая авторизация от /apanel",
		"Скорректирована работа автоматического ввода G-Auth",
		"Скорректирована функция авто-ввода пароля при входе в игру",
		"Добавлена команда /givemydonateoff в систему оффлайн выдачи форм"
	],
	"servers": [
		{ "address": "185.169.134.5:7777", "type": 1 },
		{ "address": "185.169.134.61:7777", "type": 1 },
		{ "address": "80.66.82.147:7777", "type": 1 }
	],
	"files": {
		"gps": 1,
		"gps_vc": 0,
		"questions": 0,
		"server_cmd": 0,
		"admin_cmd": 0,
		"vehicles": 0
	}
}
